; domain
(define (domain Rover)
  (:requirements :typing)
  (:types rover waypoint store camera mode lander objective)

  (:predicates (at ?x - rover ?y - waypoint) 
               (at_lander ?x - lander ?y - waypoint)
               (can_traverse ?r - rover ?x - waypoint ?y - waypoint)
               (equipped_for_soil_analysis ?r - rover)
               (equipped_for_rock_analysis ?r - rover)
               (equipped_for_imaging ?r - rover)
               (empty ?s - store)
               (have_rock_analysis ?r - rover ?w - waypoint)
               (have_soil_analysis ?r - rover ?w - waypoint)
               (full ?s - store)
               (calibrated ?c - camera ?r - rover) 
               (supports ?c - camera ?m - mode)
               (available ?r - rover)
               (visible ?w - waypoint ?p - waypoint)
               (have_image ?r - rover ?o - objective ?m - mode)
               (communicated_soil_data ?w - waypoint)
               (communicated_rock_data ?w - waypoint)
               (communicated_image_data ?o - objective ?m - mode)
               (at_soil_sample ?w - waypoint)
               (at_rock_sample ?w - waypoint)
               (visible_from ?o - objective ?w - waypoint)
               (store_of ?s - store ?r - rover)
               (calibration_target ?i - camera ?o - objective)
               (on_board ?i - camera ?r - rover)
               (channel_free ?l - lander))
  
  ;; 移動
  (:action navigate
           :parameters (?x - rover ?y - waypoint ?z - waypoint) 
           :precondition (and (can_traverse ?x ?y ?z)
                              (available ?x)
                              (at ?x ?y) 
                              (visible ?y ?z))
           :effect (and (not (at ?x ?y))
                        (at ?x ?z)))

  ;; 土をカゴに入れる
  (:action sample_soil
           :parameters (?x - rover ?s - store ?p - waypoint)
           :precondition (and (at ?x ?p)
                              (at_soil_sample ?p)
                              (equipped_for_soil_analysis ?x)
                              (store_of ?s ?x)
                              (empty ?s))
           :effect (and (not (empty ?s))
                        (full ?s)
                        (have_soil_analysis ?x ?p)
                        (not (at_soil_sample ?p))))

  ;; 石をカゴに入れる 内容は土と同じ
  (:action sample_rock
           :parameters (?x - rover ?s - store ?p - waypoint)
           :precondition (and (at ?x ?p)
                              (at_rock_sample ?p)
                              (equipped_for_rock_analysis ?x)
                              (store_of ?s ?x)
                              (empty ?s))
           :effect (and (not (empty ?s))
                        (full ?s)
                        (have_rock_analysis ?x ?p)
                        (not (at_rock_sample ?p))))

  ;; かごの中身を捨てる
  (:action drop
           :parameters (?x - rover ?y - store)
           :precondition (and (store_of ?y ?x)
                              (full ?y))
           :effect (and (not (full ?y)) (empty ?y)))

  ;; カメラの焦点を合わせる
  (:action calibrate
           :parameters (?r - rover ?i - camera ?t - objective ?w - waypoint)
           :precondition (and (equipped_for_imaging ?r)
                              (calibration_target ?i ?t)
                              (at ?r ?w)
                              (visible_from ?t ?w)
                              (on_board ?i ?r))
           :effect (calibrated ?i ?r))

  ;; 写真を取る
  (:action take_image
           :parameters (?r - rover ?p - waypoint ?o - objective ?i - camera ?m - mode)
           :precondition (and (calibrated ?i ?r)
                              (on_board ?i ?r)
                              (equipped_for_imaging ?r)
                              (supports ?i ?m)
                              (visible_from ?o ?p)
                              (at ?r ?p))
           :effect (and (have_image ?r ?o ?m)
                        (not (calibrated ?i ?r))))

  ;; データを送信
  (:action communicate_soil_data
           :parameters (?r - rover ?l - lander ?p - waypoint ?x - waypoint ?y - waypoint)
           :precondition (and (at ?r ?x)
                              (at_lander ?l ?y)
                              (have_soil_analysis ?r ?p)
                              (visible ?x ?y)
                              (available ?r)
                              (channel_free ?l))
           :effect (and (not (available ?r))
                        (not (channel_free ?l))
                        (communicated_soil_data ?p)))

  (:action communicate_rock_data
           :parameters (?r - rover ?l - lander ?p - waypoint ?x - waypoint ?y - waypoint)
           :precondition (and (at ?r ?x)
                              (at_lander ?l ?y)
                              (have_rock_analysis ?r ?p)
                              (visible ?x ?y)
                              (available ?r)
                              (channel_free ?l))
           :effect (and (not (available ?r))
                        (not (channel_free ?l))
                        (communicated_rock_data ?p)))

  (:action communicate_image_data
           :parameters (?r - rover ?l - lander ?o - objective ?m - mode ?x - waypoint ?y - waypoint)
           :precondition (and (at ?r ?x)
                              (at_lander ?l ?y)
                              (have_image ?r ?o ?m)
                              (visible ?x ?y)
                              (available ?r)
                              (channel_free ?l))
           :effect (and (not (available ?r))
                        (not (channel_free ?l))
                        (communicated_image_data ?o ?m)))

  (:action end_communication
           :parameters (?r - rover ?l - lander ?m - mode ?x - waypoint ?y - waypoint)
           :precondition (and (at ?r ?x)
                              (at_lander ?l ?y)
                              (visible ?x ?y))
           :effect (and (channel_free ?l)
                        (available ?r))))

; problem
(define (problem roverprob07) (:domain Rover)
(:objects
	general - Lander
	colour high_res low_res - Mode
	rover0 rover1 rover2 - Rover
	rover0store rover1store rover2store - Store
	waypoint0 waypoint1 waypoint2 waypoint3 waypoint4 waypoint5 - Waypoint
	camera0 camera1 - Camera
	objective0 objective1 - Objective
	)
(:init
	(visible waypoint0 waypoint3)
	(visible waypoint3 waypoint0)
	(visible waypoint0 waypoint5)
	(visible waypoint5 waypoint0)
	(visible waypoint1 waypoint0)
	(visible waypoint0 waypoint1)
	(visible waypoint2 waypoint0)
	(visible waypoint0 waypoint2)
	(visible waypoint2 waypoint1)
	(visible waypoint1 waypoint2)
	(visible waypoint2 waypoint5)
	(visible waypoint5 waypoint2)
	(visible waypoint3 waypoint2)
	(visible waypoint2 waypoint3)
	(visible waypoint4 waypoint0)
	(visible waypoint0 waypoint4)
	(visible waypoint4 waypoint3)
	(visible waypoint3 waypoint4)
	(visible waypoint5 waypoint1)
	(visible waypoint1 waypoint5)
	(visible waypoint5 waypoint4)
	(visible waypoint4 waypoint5)
	(at_soil_sample waypoint1)
	(at_rock_sample waypoint2)
	(at_rock_sample waypoint3)
	(at_soil_sample waypoint4)
	(at_rock_sample waypoint4)
	(at_rock_sample waypoint5)
	(at_lander general waypoint3)
	(channel_free general)
	(at rover0 waypoint2)
	(available rover0)
	(store_of rover0store rover0)
	(empty rover0store)
	(equipped_for_soil_analysis rover0)
	(equipped_for_rock_analysis rover0)
	(equipped_for_imaging rover0)
	(can_traverse rover0 waypoint2 waypoint0)
	(can_traverse rover0 waypoint0 waypoint2)
	(can_traverse rover0 waypoint2 waypoint1)
	(can_traverse rover0 waypoint1 waypoint2)
	(can_traverse rover0 waypoint2 waypoint3)
	(can_traverse rover0 waypoint3 waypoint2)
	(can_traverse rover0 waypoint2 waypoint5)
	(can_traverse rover0 waypoint5 waypoint2)
	(can_traverse rover0 waypoint0 waypoint4)
	(can_traverse rover0 waypoint4 waypoint0)
	(at rover1 waypoint3)
	(available rover1)
	(store_of rover1store rover1)
	(empty rover1store)
	(equipped_for_rock_analysis rover1)
	(can_traverse rover1 waypoint3 waypoint0)
	(can_traverse rover1 waypoint0 waypoint3)
	(can_traverse rover1 waypoint3 waypoint2)
	(can_traverse rover1 waypoint2 waypoint3)
	(can_traverse rover1 waypoint3 waypoint4)
	(can_traverse rover1 waypoint4 waypoint3)
	(can_traverse rover1 waypoint0 waypoint1)
	(can_traverse rover1 waypoint1 waypoint0)
	(can_traverse rover1 waypoint0 waypoint5)
	(can_traverse rover1 waypoint5 waypoint0)
	(at rover2 waypoint4)
	(available rover2)
	(store_of rover2store rover2)
	(empty rover2store)
	(equipped_for_soil_analysis rover2)
	(equipped_for_rock_analysis rover2)
	(equipped_for_imaging rover2)
	(can_traverse rover2 waypoint4 waypoint0)
	(can_traverse rover2 waypoint0 waypoint4)
	(can_traverse rover2 waypoint4 waypoint5)
	(can_traverse rover2 waypoint5 waypoint4)
	(can_traverse rover2 waypoint0 waypoint1)
	(can_traverse rover2 waypoint1 waypoint0)
	(can_traverse rover2 waypoint0 waypoint3)
	(can_traverse rover2 waypoint3 waypoint0)
	(can_traverse rover2 waypoint5 waypoint2)
	(can_traverse rover2 waypoint2 waypoint5)
	(on_board camera0 rover0)
	(calibration_target camera0 objective0)
	(supports camera0 colour)
	(supports camera0 high_res)
	(on_board camera1 rover2)
	(calibration_target camera1 objective1)
	(supports camera1 high_res)
	(visible_from objective0 waypoint0)
	(visible_from objective0 waypoint1)
	(visible_from objective0 waypoint2)
	(visible_from objective0 waypoint3)
	(visible_from objective0 waypoint4)
	(visible_from objective1 waypoint0)
	(visible_from objective1 waypoint1)
	(visible_from objective1 waypoint2)
	(visible_from objective1 waypoint3)
)

(:goal (and
(communicated_soil_data waypoint4)
(communicated_soil_data waypoint1)
(communicated_rock_data waypoint3)
(communicated_rock_data waypoint2)
(communicated_rock_data waypoint4)
(communicated_image_data objective0 high_res)
	)
)
)

; plan
1. (sample_rock rover1 rover1store waypoint3)
   deleted: (empty rover1store) (at_rock_sample waypoint3)
   added: (full rover1store) (have_rock_analysis rover1 waypoint3)
   goals met: 0 of 6
2. (sample_rock rover0 rover0store waypoint2)
   deleted: (empty rover0store) (at_rock_sample waypoint2)
   added: (full rover0store) (have_rock_analysis rover0 waypoint2)
   goals met: 0 of 6
3. (calibrate rover0 camera0 objective0 waypoint2)
   added: (calibrated camera0 rover0)
   goals met: 0 of 6
4. (take_image rover0 waypoint2 objective0 camera0 high_res)
   deleted: (calibrated camera0 rover0)
   added: (have_image rover0 objective0 high_res)
   goals met: 0 of 6
5. (sample_soil rover2 rover2store waypoint4)
   deleted: (empty rover2store) (at_soil_sample waypoint4)
   added: (full rover2store) (have_soil_analysis rover2 waypoint4)
   goals met: 0 of 6
6. (navigate rover0 waypoint2 waypoint1)
   deleted: (at rover0 waypoint2)
   added: (at rover0 waypoint1)
   goals met: 0 of 6
7. (communicate_soil_data rover2 general waypoint4 waypoint4 waypoint3)
   deleted: (available rover2) (channel_free general)
   added: (communicated_soil_data waypoint4)
   goals met: 1 of 6
8. (end_communication rover2 general colour waypoint4 waypoint3)
   added: (channel_free general) (available rover2)
   goals met: 1 of 6
9. (drop rover0 rover0store)
   deleted: (full rover0store)
   added: (empty rover0store)
   goals met: 1 of 6
10. (sample_soil rover0 rover0store waypoint1)
   deleted: (empty rover0store) (at_soil_sample waypoint1)
   added: (full rover0store) (have_soil_analysis rover0 waypoint1)
   goals met: 1 of 6
11. (navigate rover1 waypoint3 waypoint4)
   deleted: (at rover1 waypoint3)
   added: (at rover1 waypoint4)
   goals met: 1 of 6
12. (navigate rover0 waypoint1 waypoint2)
   deleted: (at rover0 waypoint1)
   added: (at rover0 waypoint2)
   goals met: 1 of 6
13. (drop rover2 rover2store)
   deleted: (full rover2store)
   added: (empty rover2store)
   goals met: 1 of 6
14. (sample_rock rover2 rover2store waypoint4)
   deleted: (empty rover2store) (at_rock_sample waypoint4)
   added: (full rover2store) (have_rock_analysis rover2 waypoint4)
   goals met: 1 of 6
15. (communicate_rock_data rover1 general waypoint3 waypoint4 waypoint3)
   deleted: (available rover1) (channel_free general)
   added: (communicated_rock_data waypoint3)
   goals met: 2 of 6
16. (end_communication rover2 general colour waypoint4 waypoint3)
   added: (channel_free general)
   goals met: 2 of 6
17. (communicate_rock_data rover0 general waypoint2 waypoint2 waypoint3)
   deleted: (available rover0) (channel_free general)
   added: (communicated_rock_data waypoint2)
   goals met: 3 of 6
18. (end_communication rover0 general colour waypoint2 waypoint3)
   added: (channel_free general) (available rover0)
   goals met: 3 of 6
19. (communicate_rock_data rover2 general waypoint4 waypoint4 waypoint3)
   deleted: (available rover2) (channel_free general)
   added: (communicated_rock_data waypoint4)
   goals met: 4 of 6
20. (end_communication rover2 general colour waypoint4 waypoint3)
   added: (channel_free general) (available rover2)
   goals met: 4 of 6
21. (communicate_image_data rover0 general objective0 high_res waypoint2 waypoint3)
   deleted: (available rover0) (channel_free general)
   added: (communicated_image_data objective0 high_res)
   goals met: 5 of 6
22. (end_communication rover0 general colour waypoint2 waypoint3)
   added: (channel_free general) (available rover0)
   goals met: 5 of 6
23. (communicate_soil_data rover0 general waypoint1 waypoint2 waypoint3)
   deleted: (available rover0) (channel_free general)
   added: (communicated_soil_data waypoint1)
   goals met: 6 of 6
